{ "name": "DorCaptcha",
  "memberOf": "$w",
  "mixes":
    [ "$w.Element",
      "$w.FocusMixin",
      "$w.HiddenCollapsedMixin" ],
  "labels":
    [ "new" ],
  "location":
    { "lineno": 8,
      "filename": "Captcha.js" },
  "docs":
    { "summary": "The reCAPTCHA element allows you to present a challenge-response test to site visitors to determine whether they are human or a bot.",
      "description":
        [ "Use the reCAPTCHA element to verify that site visitors are human before",
          "allowing them to perform restricted operations such as data submission,",
          "login, or accessing private content.",
          "",
          " <h3 id=\"captcha-lifecycle\">Typical CAPTCHA Validation Lifecycle</h3>",
          "",
          " Important: To ensure complete protection, you must include backend [authorization](wix-captcha-backend.html#authorize) as a mandatory step of the CAPTCHA validation lifecycle.",
          "",
          " The following outlines a typical CAPTCHA validation lifecycle:",
          "",
          " 1. A button or another clickable element that triggers a submit, login, or another restricted operation is disabled, pending CAPTCHA verification.",
          " 1. A site visitor completes the CAPTCHA challenge. One of the following occurs:",
          "     * Verification: The CAPTCHA is verified. A [`token`]($w.Captcha.html#token) is generated. The `onVerified()` event indicates a successful CAPTCHA challenge completion. Use the [`onVerified()`]($w.Captcha.html#onVerified) event handler to enable the disabled clickable element.",
          "     * Error: The reCAPTCHA element loses connection with the CAPTCHA provider. You can use the [`onError()`]($w.Captcha.html#onError) event handler to instruct the visitor to try again later. Return to Step 1.",
          " 1. The clickable element is enabled. One of the following occurs:",
          "     * Click: The site visitor clicks the clickable element, triggering a backend function that calls [`authorize()`](wix-captcha-backend.html#authorize) with the generated [`token`]($w.Captcha.html#token).",
          "     * Timeout: The site visitor did not click the submit button within 120 seconds of token generation, causing the token to expire. When timeout occurs, the reCAPTCHA element automatically resets and displays a message asking the site visitor to redo the challenge. Use the [`onTimeout()`]($w.Captcha.html#onTimeout) event handler to disable the clickable trigger. Return to Step 1.",
          " 1. [`authorize()`](wix-captcha-backend.html#authorize) checks whether the token is valid. One of the following occurs:",
          "     * Authorization: The CAPTCHA is authorized. Perform the restricted operation (such as data insert) in the backend function. [`reset()`]($w.Captcha.html#reset) the reCAPTCHA element for future operations.",
          "     * Error: Token fails authorization. [`reset()`]($w.Captcha.html#reset) the reCAPTCHA element and ask the visitor to redo the challenge. Return to Step 1.",
          "",
          "",
          "For more information on working with your reCAPTCHA element, click <a href=\"https://support.wix.com/en/article/corvid-tutorial-using-captcha-to-protect-data-submission\" target=\"_blank\">here</a>." ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations": [],
  "callbacks": [],
  "messages": [],
  "extra":
    { "notes":
        [ "The reCAPTCHA element does not offer protection for data submission performed via a dataset. To protect data submission with CAPTCHA, use code to perform the data operation (for example, [`insert()`](wix-data.html#insert) or [`save()`](wix-data.html#save))." ],
      "queryable": true } }